posts/courses/deep-learning-in-python/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Deep Learning in Python | Warren Liu</title>
<link href="../../../assets/css/rst.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/poole.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/lanyon.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/custom.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="//fonts.googleapis.com/css?family=PT+Serif:400,400italic,700%7CPT+Sans:400">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../../rss.xml">
<link rel="canonical" href="https://wudong.graceliu.uk/posts/courses/deep-learning-in-python/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Warren Liu">
<link rel="prev" href="../coursea-scala/" title="Coursea Scala" type="text/html">
<link rel="next" href="../../notes/functional-programming-notes/" title="Functional Programming Note" type="text/html">
<meta property="og:site_name" content="Warren Liu">
<meta property="og:title" content="Deep Learning in Python">
<meta property="og:url" content="https://wudong.graceliu.uk/posts/courses/deep-learning-in-python/">
<meta property="og:description" content="Table of Contents


Data Pre-processing





Data Pre-processing


Logistic regression / neural networks work on numerical vectors, not
categories.

One-hot encoding, to change a categories to  numeri">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-18T00:00:00+01:00">
<meta property="article:tag" content="algorithm">
<meta property="article:tag" content="deep learning">
<meta property="article:tag" content="python">
</head>
<body>
    <a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>
    <!-- Target for toggling the sidebar `.sidebar-checkbox` is for regular
            styles, `#sidebar-checkbox` for behavior. -->
    <input type="checkbox" class="sidebar-checkbox" id="sidebar-checkbox"><!-- Toggleable sidebar --><div class="sidebar" id="sidebar">
        <div class="sidebar-item">
            <p>A reserved <a href="https://getnikola.com" target="_blank">Nikola</a> theme that places the utmost gravity on content with a hidden drawer. Made by <a href="https://twitter.com/mdo" target="_blank">@mdo</a> for Jekyll,
            ported to Nikola by <a href="https://twitter.com/ralsina" target="_blank">@ralsina</a>.</p>
        </div>
        
    <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../../archive.html">Archive</a>
        <a class="sidebar-nav-item" href="../../../categories/">Tags</a>
        <a class="sidebar-nav-item" href="../../../rss.xml">RSS feed</a>
    
    
    </nav>
</div>

    <!-- Wrap is the content to shift when toggling the sidebar. We wrap the
         content to avoid any CSS collisions with our real content. -->
    <div class="wrap">
      <div class="masthead">
        <div class="container">
          
    <h3 id="brand" class="masthead-title">
      <a href="https://wudong.graceliu.uk/" title="Warren Liu" rel="home">Warren Liu</a>
    </h3>

        </div>
      </div>

      <div class="container content" id="content">
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="post-title p-name entry-title" itemprop="headline name"><a href="." class="u-url">Deep Learning in Python</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn">Warren Liu</span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="post-date published dt-published" datetime="2017-07-18T00:00:00+01:00" itemprop="datePublished" title="2017-07-18 00:00">2017-07-18 00:00</time></a></p>
        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Data Pre-processing</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Data Pre-processing</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Logistic regression / neural networks work on numerical vectors, not
categories.
</li>
<li>One-hot encoding, to change a categories to  numerical values:
For example, Time of day is a category of 4: 0, 1, 2, 3, it can be
encoded as:
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="right">
<col class="right">
<col class="right">
<col class="right">
</colgroup>
<thead><tr>
<th scope="col" class="right">12am-6am</th>
<th scope="col" class="right">6am-12pm</th>
<th scope="col" class="right">12pm-6pm</th>
<th scope="col" class="right">6pm-12am</th>
</tr></thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
</tr>
<tr>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">0</td>
</tr>
<tr>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">0</td>
</tr>
<tr>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">1</td>
</tr>
</tbody>
</table>
<p>
Having a 1 for each column.
</p>
</li>
<li>Binary categories don't need 2 columns for "true" and "false". Just
absorb the "false" into the bias term.
</li>
<li>Numerical columns: <br>
  Simple way to normalization (0 mean, 1 standard deviation): minus
the mean and devided by the deviation.
</li>
</ul>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../../categories/algorithm/" rel="tag">algorithm</a></li>
            <li><a class="tag p-category" href="../../../categories/deep-learning/" rel="tag">deep learning</a></li>
            <li><a class="tag p-category" href="../../../categories/python/" rel="tag">python</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../coursea-scala/" rel="prev" title="Coursea Scala">Previous post</a>
            </li>
            <li class="next">
                <a href="../../notes/functional-programming-notes/" rel="next" title="Functional Programming Note">Next post</a>
            </li>
        </ul></nav></aside></article><footer id="footer"><p>Contents © 2017         <a href="mailto:wudong@graceliu.uk">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </div>
    <label for="sidebar-checkbox" class="sidebar-toggle"></label>
    
    
    
            <script src="../../../assets/js/jquery.min.js"></script><script src="../../../assets/js/moment-with-locales.min.js"></script><script src="../../../assets/js/fancydates.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
